"""
Інформація для заповнення меню клієнта,
геолокації
"""

SUPER_ADMIN_IDS = [6539889022, 887934499, 793766567]


VALID_CITIES = ["Бердичів", "Дніпро", "Житомир", "Ізмаїл" , "Запоріжжя" , "Івано-Франківськ", "Львів",
    "Кривій Ріг", "Кропивницький", "Луцьк", "Одеса", "Первомайськ", "Рівне", "Ужгород",
    "Київ", "Харків", "Чернігів"]

cities = [
    "Бердичів", "Дніпро", "Житомир", "Ізмаїл" , "Запоріжжя" , "Івано-Франківськ", "Львів",
    "Кривій Ріг", "Кропивницький", "Луцьк", "Одеса", "Первомайськ", "Рівне", "Ужгород",
    "Київ", "Харків", "Чернігів"
]

about_info = ("Хто ми? Ми — “Мама, ну купи”, мережа яскравих автоматів із сюрприз боксами,"
              " які дарують дітям радість і незабутні емоції! 💫 "
              "Наші бокси — це маленькі скарби, в яких заховані іграшки,"
              " що викликають посмішки, захоплення та бажання відкрити ще один.)"
              "Ми створили простий, веселий та безпечний спосіб зробити маленьке свято"
              " в будь-який момент — під час прогулянки, шопінгу або просто по дорозі додому. 🧸")


question_1 = "Чи можна обрати, що буде в боксі?"
question_2 = "Скільки іграшок можна знайти?"
question_3 = "А можна оплатити готівкою?"
question_4 = "Чи оновлюються іграшки в боксах?"
question_5 = "Чи є бокси для різної статі?"
question_6 = "Скільки коштує один бокс?"


answer_1 = "Ні, там буде сюрприз 🤩 Але трендові наповнення Вас точно порадує!"
answer_2 = "В наших боксах можна знайти від 4 до 10 іграшок"
answer_3 = "Так, звичайно. В автоматах доступна оплата терміналом та готівкою."
answer_4 = "Звичайно,в нас величезний асортимент, який оновлюється щотижня😉"
answer_5 = "Так, ми маємо бокси для хлопчиків і дівчаток👫🏻"
answer_6 = "Наші бокси мають доступну цінову політику для усіх, так як ціни варіюються від 100 до 500 гривень."



CITIES_LOCATION = {
    "Бердичів": [
        {"lat": 49.8924814, "lon": 28.5892709, "address": "вул. Європейська, 26, ТРЦ Галерея Бальзак"}
    ],
    "Дніпро": [
        {"lat": 48.4390738, "lon": 35.0505475, "address": "вул. Марії Кюрі, 5, ТРЦ Neo Plaza"}
    ],
    "Житомир": [
        {"lat": 50.2543166, "lon": 28.6652949, "address": "вул. Лятошинського, 2, ТРЦ ФОРА"},
        {"lat": 50.2665508, "lon": 28.6852504, "address": "вул. Київська, 77, ТРЦ Global (1 поверх)"},
        {"lat": 50.2665508, "lon": 28.6852504, "address": "вул. Київська, 77, ТРЦ Global (2 поверх)"},
        {"lat": 50.2673948, "lon": 28.6971441, "address": "вул. Вокзальна, 6б, Супермаркет Рінг"}
    ],
    "Запоріжжя": [
        {"lat": 47.8471658, "lon": 35.2369725, "address": "вул. Чарівна, 74, ТРЦ Амстор"},
        {"lat": 47.819279, "lon": 35.0538411, "address": "вул. Інженера Преображенського, 13, ТРЦ Амстор"},
        {"lat": 47.7842346, "lon": 35.2214504, "address": "вул. Північно‑Кільцева, 10а, Супермаркет Варус"}
    ],
    "Ізмаїл": [
        {"lat": 45.352495, "lon": 28.805569, "address": "Супермаркет Таврія В, Ізмаїл"}
    ],
    "Івано‑Франківськ": [
        {"lat": 48.9408944, "lon": 24.7371824, "address": "вул. Вовчинецька, 225а, ТРЦ Veles Mall"}
    ],
    "Львів": [
        {"lat": 49.8074249, "lon": 23.9779772, "address": "вул. Кульпарківська, 226А, ТРЦ Victoria Gardens"},
        {"lat": 49.822536, "lon": 23.9580429, "address": "вул. Патона, 37, ТРЦ Арсен Fly Kids"},
        {"lat": 49.7735185, "lon": 24.0073383, "address": "вул. Стрийська, 30, ТРЦ King Cross Leopolis"},
    ],
    "Кривий Ріг": [
        {"lat": 48.0011082, "lon": 33.4819404, "address": "5‑й мкр. Зарічний, 11к, ТК «TERRA»"}
    ],
    "Кропивницький": [
        {"lat": 48.4952847, "lon": 32.2199161, "address": "вул. Героїв України, 6/13, ТЦ CityPoint"}
    ],
    "Луцьк": [
        {"lat": 50.7535974, "lon": 25.3325338, "address": "просп. Президента Грушевського, 2, ТРЦ Промінь"}
    ],
    "Одеса": [
        {"lat": 46.4689096, "lon": 30.7371779, "address": "Новощіпний ряд, 2, 5 поверх, ТРЦ Острів Fly Kids"},
        {"lat": 46.4323718, "lon": 30.7613369, "address": "вул. Генуезька, 5/2, 4 поверх, Gagarin Plaza"}
    ],
    "Первомайськ": [
        {"lat": 48.0495811, "lon": 30.8527319, "address": "вул. Олександріївська, 1, біля кафе Family time"}
    ],
    "Рівне": [
        {"lat": 50.6188025, "lon": 26.24842, "address": "вул. Олександра Борисенка, 1, ТРЦ Злата Плаза"},
        {"lat": 50.6165642, "lon": 26.2798165, "address": "вул. Київська, 67, ТРЦ Арена FLY KIDS"},
        {"lat": 50.5978963, "lon": 26.2628256, "address": "вул. В’ячеслава Чорновола, 91, ТРЦ HAPPY MALL"},
        {"lat": 50.6384888, "lon": 26.266142, "address": "вул. Євгена Коновальця, 1, ТРЦ Sky Up"}
    ],
    "Минай": [
        {"lat": 48.595894, "lon": 22.2829703, "address": "вул. Козацька, 1А, RЦ Imperia Family Park"}
    ],
    "Харків": [
        {"lat": 49.990232, "lon": 36.2894701, "address": "вул. Академіка Павлова, 44‑Б, ТРЦ Французький Бульвар"}
    ],
    "Київ": [
        {"lat": 50.4862338, "lon": 30.5217914, "address": "просп. Степана Бандери, 36, ТРЦ Blockbuster Mall"},
        {"lat": 50.5055115, "lon": 30.472077, "address": "вул. Лугова, 12, ТРЦ Караван Fly Kids"},
        {"lat": 50.3737775, "lon": 30.444867, "address": "Кільцева дорога, 1, ТРЦ Respublika Park"},
        {"lat": 50.4948485, "lon": 30.3583002, "address": "вул. Берковецька, 6Б, ТРЦ Lavina"},
        {"lat": 50.4084648, "lon": 30.5436428, "address": "вул. Андрія Верхогляда, 17, Нова Пошта 111"},
        {"lat": 50.5129107, "lon": 30.6232106, "address": "вул. Миколи Закревського, 61/2, ТРЦ Парк Закревського"},
        {"lat": 50.4932048, "lon": 30.5763357, "address": "вул. Петра Вершигори, 1, ТРЦ Дніпровський Fly Kids"},
        {"lat": 50.5037881, "lon": 30.415975, "address": "ТРЦ Ретровіль, біля Fast Food, 2 поверх, вхід №2"},
        {"lat": 50.4506677, "lon": 30.4406792, "address": "вул. Вадима Гетьмана, 6, Космо Мульти Молл Дитяча Планета"},
        {"lat": 50.4194416, "lon": 30.6268216, "address": "вул. Здолбунівська, 17, TРЦ Ашан Fly Kids"},
        {"lat": 50.3961932, "lon": 30.632246, "address": "вулиця Михайла Гришка, 3а, та, 5 (прохід між ТРЦ Аладін)"},
    ],
    "Чернігів": [
        {"lat": 51.523555, "lon": 31.258784, "address": "просп. Левка Лук'яненка, 74, ТРЦ HOLLYWOOD Fly Kids"}
    ]
}


how_to_create = ("Для того щоб створити адміна вам потрібно ID телеграм аккаунта,\n"
                 "його можна отримати за допомогою бота @myidbot.\n"
                 "Відправте посилання на цього бота людині яку ви хочете зробити адміном.\n"
                 "Далі натисніть кнопку Створити адміна, і там по інструкції введіть ID який ви отримали")

